# Задача № 1
# Найти сyмму трех введеных целых чисел
print('Задача № 1')
print('Найти сyмму трех введеных целых чисел')

print('Введите первое число: ')
a	=	int(input())
print('Введите второе число: ')
b	=	int(input())
print('Введите третье число: ')
c	=	int(input())
sum = a + b + c
print('Сумма трех чисел: ',sum)
