# Задача № 2
# Ввести с клавиатуры радиус круга. Вывести в терминал площадь круга

print('  Задача № 2')
print('  Ввести с клавиатуры радиус круга. Вычислить площать круга.\n')

r = int(input('Bвeдите радиус кpyra:\t '))
print('Площадь круга:\t\t',(r*r)*3.14)